  01 AllTelAbend.
    03 ALLTEL_MQ_HEADER.
      05 ACAI_STRUCT_ID                  PIC X(4).
      05 ACAI_VERSION                    PIC 9(4).
      05 ACAI_CHANNEL                    PIC X(4). 
      05 ACAI_SERVICE_NAME               PIC X(48).
      05 ACAI_USER_ID                    PIC X(8)
      05 ACAI_SESSION_ID                 PIC X(113).
      
      